wolfSSL/wolfip/src/port/stm32h563/main.c
    http_send_response_headers(hc, HTTP_STATUS_OK, "OK", "text/html", len);
    http_send_response_body(hc, response, len);
    return 0;
}
#endif

#define ECHO_PORT 7
#define RX_BUF_SIZE 1024

#if TZEN_ENABLED
#define RCC_BASE 0x54020C00u  /* Secure alias */
#define ETH_BASE_DBG 0x50028000u  /* Secure ETH for debug */
#else
#define RCC_BASE 0x44020C00u  /* Non-secure alias */
#define ETH_BASE_DBG 0x40028000u  /* Non-secure ETH for debug */
#endif
#define RCC_AHB1ENR  (*(volatile uint32_t *)(RCC_BASE + 0x88u))
#define RCC_AHB2ENR  (*(volatile uint32_t *)(RCC_BASE + 0x8Cu))
#define RCC_APB3ENR  (*(volatile uint32_t *)(RCC_BASE + 0xA8u))
#define RCC_CR       (*(volatile uint32_t *)(RCC_BASE + 0x00u))
#define RCC_CCIPR5   (*(volatile uint32_t *)(RCC_BASE + 0xE8u))
#define RCC_AHB1RSTR (*(volatile uint32_t *)(RCC_BASE + 0x60u))
#define RCC_AHB1RSTR_ETHRST (1u << 19)
#define RCC_AHB2ENR_RNGEN   (1u << 18)
#define RCC_CR_HSI48ON      (1u << 12)
#define RCC_CR_HSI48RDY     (1u << 13)
#define RCC_CCIPR5_RNGSEL_Msk (3u << 4)

/* SAU (Security Attribution Unit) - mark memory regions as non-secure */
#define SAU_CTRL   (*(volatile uint32_t *)0xE000EDD0u)
#define SAU_RNR    (*(volatile uint32_t *)0xE000EDD8u)
#define SAU_RBAR   (*(volatile uint32_t *)0xE000EDDCu)
#define SAU_RLAR   (*(volatile uint32_t *)0xE000EDE0u)

/* GTZC (Global TrustZone Controller) - unlock SRAM for DMA access */
#if TZEN_ENABLED
/* Secure addresses when running in secure mode with TZEN=1 */
#define GTZC1_BASE         0x50032400u  /* Secure alias */
#else
#define GTZC1_BASE         0x40032400u  /* Non-secure alias */
#endif
#define GTZC1_MPCBB1_CR    (*(volatile uint32_t *)(GTZC1_BASE + 0x800u))
#define GTZC1_MPCBB2_CR    (*(volatile uint32_t *)(GTZC1_BASE + 0xC00u))
#define GTZC1_MPCBB3_CR    (*(volatile uint32_t *)(GTZC1_BASE + 0x1000u))
/* MPCBB SECCFGR registers - each bit controls 256 bytes of SRAM */
#define GTZC1_MPCBB3_SECCFGR(n) (*(volatile uint32_t *)(GTZC1_BASE + 0x1000u + 0x100u + ((n) * 4u)))
/* MPCBB PRIVCFGR registers - each bit controls privilege for 256 bytes of SRAM */
#define GTZC1_MPCBB3_PRIVCFGR(n) (*(volatile uint32_t *)(GTZC1_BASE + 0x1000u + 0x200u + ((n) * 4u)))
/* TZSC SECCFGR registers - control peripheral security */
#define GTZC1_TZSC_SECCFGR1 (*(volatile uint32_t *)(GTZC1_BASE + 0x010u))
#define GTZC1_TZSC_SECCFGR2 (*(volatile uint32_t *)(GTZC1_BASE + 0x014u))
#define GTZC1_TZSC_SECCFGR3 (*(volatile uint32_t *)(GTZC1_BASE + 0x018u))

/* GPIO base addresses */
#if TZEN_ENABLED
#define GPIOA_BASE 0x52020000u  /* Secure alias */
#define GPIOB_BASE 0x52020400u
#define GPIOC_BASE 0x52020800u
#define GPIOG_BASE 0x52021800u
#else
#define GPIOA_BASE 0x42020000u  /* Non-secure alias */
#define GPIOB_BASE 0x42020400u
#define GPIOC_BASE 0x42020800u
#define GPIOG_BASE 0x42021800u
#endif

/* GPIO register offsets */
#define GPIO_MODER(base)   (*(volatile uint32_t *)((base) + 0x00u))
#define GPIO_OSPEEDR(base) (*(volatile uint32_t *)((base) + 0x08u))
#define GPIO_PUPDR(base)   (*(volatile uint32_t *)((base) + 0x0Cu))
#define GPIO_AFRL(base)    (*(volatile uint32_t *)((base) + 0x20u))
#define GPIO_AFRH(base)    (*(volatile uint32_t *)((base) + 0x24u))

/* SBS (System Bus Security) for RMII selection */
/* SBS register definitions - PMCR is at offset 0x100 in SBS structure */
#if TZEN_ENABLED
#define SBS_BASE        0x54000400u  /* Secure alias */
#else
#define SBS_BASE        0x44000400u  /* Non-secure alias */
#endif
#define SBS_PMCR        (*(volatile uint32_t *)(SBS_BASE + 0x100u))
#define SBS_PMCR_ETH_SEL_RMII (4u << 21)

/* USART3 for debug output (ST-Link VCP on NUCLEO-H563ZI) */
#define GPIOD_BASE 0x42020C00u
#define GPIOF_BASE 0x42021400u
#define RCC_APB1ENR (*(volatile uint32_t *)(RCC_BASE + 0x9Cu))
#define USART3_BASE 0x40004800u
#define USART3_CR1 (*(volatile uint32_t *)(USART3_BASE + 0x00u))
#define USART3_BRR (*(volatile uint32_t *)(USART3_BASE + 0x0Cu))
#define USART3_ISR (*(volatile uint32_t *)(USART3_BASE + 0x1Cu))
#define USART3_TDR (*(volatile uint32_t *)(USART3_BASE + 0x28u))

/* LED2 on PF4 */
#define GPIO_ODR(base)     (*(volatile uint32_t *)((base) + 0x14u))
#define GPIO_BSRR(base)    (*(volatile uint32_t *)((base) + 0x18u))
#define LED2_PIN 4u

#if TZEN_ENABLED
#define RNG_BASE 0x520C0800u
#else
#define RNG_BASE 0x420C0800u
#endif
#define RNG_CR   (*(volatile uint32_t *)(RNG_BASE + 0x00u))
#define RNG_SR   (*(volatile uint32_t *)(RNG_BASE + 0x04u))
#define RNG_DR   (*(volatile uint32_t *)(RNG_BASE + 0x08u))
#define RNG_CR_RNGEN          (1u << 2)
#define RNG_CR_CONDRST        (1u << 30)
#define RNG_CR_CONFIG3_SHIFT  8u
#define RNG_CR_CONFIG2_SHIFT  13u
#define RNG_CR_CLKDIV_SHIFT   16u
#define RNG_CR_CONFIG1_SHIFT  20u
#define RNG_SR_DRDY           (1u << 0)
#define RNG_SR_CECS           (1u << 1)
#define RNG_SR_SECS           (1u << 2)
#define RNG_SR_CEIS           (1u << 5)
#define RNG_SR_SEIS           (1u << 6)

static struct wolfIP *IPStack;
#ifndef WOLFIP_USE_FREERTOS
static int listen_fd = -1;
static int client_fd = -1;
static uint8_t rx_buf[RX_BUF_SIZE];
#endif

static void rng_init(void)
{
    uint32_t rng_cr;

    RCC_CR |= RCC_CR_HSI48ON;
    while ((RCC_CR & RCC_CR_HSI48RDY) == 0u) {
    }

    /* Select HSI48 as the RNG kernel clock. */
    RCC_CCIPR5 &= ~RCC_CCIPR5_RNGSEL_Msk;
    RCC_AHB2ENR |= RCC_AHB2ENR_RNGEN;
    delay(100);

    rng_cr = RNG_CR;
    rng_cr &= ~(0x1Fu << RNG_CR_CONFIG1_SHIFT);
    rng_cr &= ~(0x7u << RNG_CR_CLKDIV_SHIFT);
    rng_cr &= ~(0x3u << RNG_CR_CONFIG2_SHIFT);
    rng_cr &= ~(0x7u << RNG_CR_CONFIG3_SHIFT);
    rng_cr |= 0x0Fu << RNG_CR_CONFIG1_SHIFT;
    rng_cr |= 0x0Du << RNG_CR_CONFIG3_SHIFT;

    RNG_CR = RNG_CR_CONDRST | rng_cr;
    while ((RNG_CR & RNG_CR_CONDRST) == 0u) {
    }
    RNG_CR = rng_cr | RNG_CR_RNGEN;
    while ((RNG_SR & RNG_SR_DRDY) == 0u) {
    }
}

static int rng_get_word(uint32_t *out)
{
    uint32_t timeout = 100000u;

    while ((RNG_SR & RNG_SR_DRDY) == 0u) {
        if ((RNG_SR & (RNG_SR_CECS | RNG_SR_SECS | RNG_SR_CEIS | RNG_SR_SEIS)) != 0u) {
            rng_init();
            timeout = 100000u;
            continue;
        }
        if (--timeout == 0u) {
            return -1;
        }
    }

