wolfSSL/wolfip/src/port/stm32h563/main.c
    *out = RNG_DR;
    return 0;
}

int custom_rand_gen_block(unsigned char *output, unsigned int sz)
{
    uint32_t word;

    while (sz >= 4u) {
        if (rng_get_word(&word) != 0) {
            return -1;
        }
        output[0] = (unsigned char)word;
        output[1] = (unsigned char)(word >> 8);
        output[2] = (unsigned char)(word >> 16);
        output[3] = (unsigned char)(word >> 24);
        output += 4;
        sz -= 4;
    }

    if (sz > 0u) {
        if (rng_get_word(&word) != 0) {
            return -1;
        }
        while (sz-- > 0u) {
            *output++ = (unsigned char)word;
            word >>= 8;
        }
    }

    return 0;
}

uint32_t wolfIP_getrandom(void)
{
    uint32_t word = 0u;

    (void)rng_get_word(&word);
    return word;
}

/* Simple delay */
static void delay(uint32_t count)
{
    for (volatile uint32_t i = 0; i < count; i++) { }
}

/* Initialize LED2 on PF4 */
static void led_init(void)
{
    uint32_t moder;

    /* Enable GPIOF clock */
    RCC_AHB2ENR |= (1u << 5);
    delay(100);

    /* Set PF4 as output */
    moder = GPIO_MODER(GPIOF_BASE);
    moder &= ~(3u << (LED2_PIN * 2u));
    moder |= (1u << (LED2_PIN * 2u));  /* Output mode */
    GPIO_MODER(GPIOF_BASE) = moder;
}

static void led_on(void)
{
    GPIO_BSRR(GPIOF_BASE) = (1u << LED2_PIN);
}

static void led_off(void)
{
    GPIO_BSRR(GPIOF_BASE) = (1u << (LED2_PIN + 16u));
}

#ifndef WOLFIP_USE_FREERTOS
static void led_toggle(void)
{
    GPIO_ODR(GPIOF_BASE) ^= (1u << LED2_PIN);
}
#endif

/* USART3 additional registers */
#define USART3_CR2 (*(volatile uint32_t *)(USART3_BASE + 0x04u))
#define USART3_CR3 (*(volatile uint32_t *)(USART3_BASE + 0x08u))
#define USART3_PRESC (*(volatile uint32_t *)(USART3_BASE + 0x2Cu))

/* Initialize USART3 for debug output (115200 baud @ 64MHz HSI) */
static void uart_init(void)
{
    uint32_t moder, afr;

    /* Enable GPIOD clock */
    RCC_AHB2ENR |= (1u << 3);
    /* Enable USART3 clock (APB1LENR bit 18) */
    RCC_APB1ENR |= (1u << 18);

    delay(100);

    /* Configure PD8 (TX) as AF7, push-pull, high speed */
    moder = GPIO_MODER(GPIOD_BASE);
    moder &= ~(3u << 16);  /* Clear PD8 mode */
    moder |= (2u << 16);   /* Alternate function */
    GPIO_MODER(GPIOD_BASE) = moder;

    GPIO_OSPEEDR(GPIOD_BASE) |= (3u << 16);  /* High speed for PD8 */

    afr = GPIO_AFRH(GPIOD_BASE);
    afr &= ~(0xFu << 0);   /* PD8 is AFRH bit 0-3 */
    afr |= (7u << 0);      /* AF7 = USART3 */
    GPIO_AFRH(GPIOD_BASE) = afr;

    /* Disable USART before configuration */
    USART3_CR1 = 0;

    /* Configure USART3: 115200 baud, assuming PCLK1 = 32MHz */
    USART3_CR2 = 0;  /* 1 stop bit */
    USART3_CR3 = 0;  /* No flow control, disable FIFO */
    USART3_PRESC = 0;  /* No prescaler */
    USART3_BRR = 32000000u / 115200u;  /* 278 */

    /* Enable transmitter, then enable USART */
    USART3_CR1 = (1u << 3);  /* TE */
    delay(10);
    USART3_CR1 |= (1u << 0);  /* UE */
    delay(100);
}

static void uart_putc(char c)
{
    while ((USART3_ISR & (1u << 7)) == 0) { }  /* Wait for TXE */
    USART3_TDR = (uint32_t)c;
}

static void uart_puts(const char *s)
{
    while (*s) {
        if (*s == '\n') uart_putc('\r');
        uart_putc(*s++);
    }
}

void wolfssl_tls13_dbg_hex(const char *tag, const unsigned char *buf,
    unsigned len)
{
    static const char hex[] = "0123456789abcdef";
    char line[96];
    unsigned i = 0;
    unsigned pos;

    if (tag != NULL) {
        uart_puts(tag);
    }
    if (buf == NULL) {
        uart_puts("<null>\n");
        return;
    }

    while (i < len) {
        pos = 0;
        while (i < len && pos + 2 < sizeof(line) - 2) {
            line[pos++] = hex[(buf[i] >> 4) & 0x0Fu];
            line[pos++] = hex[buf[i] & 0x0Fu];
            i++;
        }
        line[pos++] = '\n';
        line[pos] = '\0';
        uart_puts(line);
    }
}

#ifdef WOLFIP_USE_FREERTOS
static void freertos_diag_print_u32(const char *prefix, uint32_t value)
{
    char buf[32];

    (void)snprintf(buf, sizeof(buf), "%lu", (unsigned long)value);
    uart_puts(prefix);
    uart_puts(buf);
    uart_puts("\n");
}

void vApplicationMallocFailedHook(void)
{
    uart_puts("FreeRTOS: malloc failed\n");
    freertos_diag_print_u32("  free heap: ",
        (uint32_t)xPortGetFreeHeapSize());
    freertos_diag_print_u32("  min ever free heap: ",
        (uint32_t)xPortGetMinimumEverFreeHeapSize());
    for (;;) { }
}

void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName)
{
    (void)xTask;
    uart_puts("FreeRTOS: stack overflow\n");
    if (pcTaskName != NULL) {
        uart_puts("  task: ");
        uart_puts(pcTaskName);
        uart_puts("\n");
    }
    for (;;) { }
}
#endif

/* Printf-style UART output for wolfMQTT broker logging (WBLOG macros).
 * Uses vsnprintf from newlib-nano + uart_puts. */
void wolfmqtt_log(const char *fmt, ...)
{
    char buf[256];
    va_list ap;
    int n;
    va_start(ap, fmt);
    n = vsnprintf(buf, sizeof(buf), fmt, ap);
    va_end(ap);
    if (n < 0) {
        uart_puts("<wolfmqtt_log: encoding error>\n");
        return;
    }
    uart_puts(buf);
    if (n >= (int)sizeof(buf))
        uart_puts("...[truncated]\n");
}

static void uart_puthex(uint32_t val)
{
    const char hex[] = "0123456789ABCDEF";
    uart_puts("0x");
    for (int i = 28; i >= 0; i -= 4) {
        uart_putc(hex[(val >> i) & 0xF]);
    }
}

static void uart_puthex8(uint8_t val)
{
    const char hex[] = "0123456789ABCDEF";
    uart_putc(hex[(val >> 4) & 0xF]);
    uart_putc(hex[val & 0xF]);
}

static void uart_putdec(uint32_t val)
{
    char buf[12];
    int i = 0;
    if (val == 0) {
        uart_putc('0');
        return;
    }
    while (val > 0 && i < 11) {
        buf[i++] = '0' + (val % 10);
        val /= 10;
    }
    while (i > 0) {
        uart_putc(buf[--i]);
    }
}

static void uart_putip4(ip4 ip)
{
    uart_putdec((ip >> 24) & 0xFF);
    uart_putc('.');
    uart_putdec((ip >> 16) & 0xFF);
    uart_putc('.');
    uart_putdec((ip >> 8) & 0xFF);
    uart_putc('.');
    uart_putdec(ip & 0xFF);
}

