wolfSSL/wolfip/src/port/stm32h563/main.c
/* Configure GPIO pin for Ethernet alternate function (AF11) */
static void gpio_eth_pin(uint32_t base, uint32_t pin)
{
    uint32_t moder, ospeedr, afr;
    uint32_t pos2 = pin * 2u;

    /* Set mode to alternate function (0b10) */
    moder = GPIO_MODER(base);
    moder &= ~(3u << pos2);
    moder |= (2u << pos2);
    GPIO_MODER(base) = moder;

    /* Set high speed */
    ospeedr = GPIO_OSPEEDR(base);
    ospeedr |= (3u << pos2);
    GPIO_OSPEEDR(base) = ospeedr;

    /* Set AF11 for Ethernet */
    if (pin < 8u) {
        afr = GPIO_AFRL(base);
        afr &= ~(0xFu << (pin * 4u));
        afr |= (11u << (pin * 4u));
        GPIO_AFRL(base) = afr;
    } else {
        afr = GPIO_AFRH(base);
        afr &= ~(0xFu << ((pin - 8u) * 4u));
        afr |= (11u << ((pin - 8u) * 4u));
        GPIO_AFRH(base) = afr;
    }
}

/* Initialize GPIO pins for RMII Ethernet (NUCLEO-H563ZI pinout) */
static void eth_gpio_init(void)
{
    /* SBS->PMCR is at SBS_BASE + 0x100 = 0x44000400 + 0x100 = 0x44000500 */
    volatile uint32_t *sbs_pmcr = (volatile uint32_t *)(0x44000500u);
    uint32_t val;

    /* Enable GPIO clocks: A, B, C, G */
    RCC_AHB2ENR |= (1u << 0) | (1u << 1) | (1u << 2) | (1u << 6);

    /* Enable SBS clock for RMII selection - bit 1 in APB3ENR (RCC_APB3ENR_SBSEN) */
    RCC_APB3ENR |= (1u << 1);

    /* Delay for clock to stabilize */
    for (volatile int i = 0; i < 10000; i++) { }

    /* Set RMII mode: read-modify-write to preserve other bits */
    val = *sbs_pmcr;
    val &= ~(0x7u << 21);  /* Clear ETH_SEL bits */
    val |= (0x4u << 21);   /* Set ETH_SEL = 100 for RMII */
    *sbs_pmcr = val;
    for (volatile int i = 0; i < 1000; i++) { }

    /* Configure RMII pins for NUCLEO-H563ZI (from ST HAL):
     * PA1  - ETH_REF_CLK (AF11)
     * PA2  - ETH_MDIO (AF11)
     * PA7  - ETH_CRS_DV (AF11)
     * PC1  - ETH_MDC (AF11)
     * PC4  - ETH_RXD0 (AF11)
     * PC5  - ETH_RXD1 (AF11)
     * PB15 - ETH_TXD1 (AF11)
     * PG11 - ETH_TX_EN (AF11)
     * PG13 - ETH_TXD0 (AF11)
     */
    gpio_eth_pin(GPIOA_BASE, 1);   /* REF_CLK */
    gpio_eth_pin(GPIOA_BASE, 2);   /* MDIO */
    gpio_eth_pin(GPIOA_BASE, 7);   /* CRS_DV */
    gpio_eth_pin(GPIOC_BASE, 1);   /* MDC */
    gpio_eth_pin(GPIOC_BASE, 4);   /* RXD0 */
    gpio_eth_pin(GPIOC_BASE, 5);   /* RXD1 */
    gpio_eth_pin(GPIOB_BASE, 15);  /* TXD1 */
    gpio_eth_pin(GPIOG_BASE, 11);  /* TX_EN */
    gpio_eth_pin(GPIOG_BASE, 13);  /* TXD0 */
}

#ifdef ENABLE_TLS_CLIENT
/* Callback for TLS client responses */
static void tls_response_cb(const char *data, int len, void *ctx)
{
    (void)ctx;
    uart_puts("TLS Client received ");
    uart_putdec((uint32_t)len);
    uart_puts(" bytes:\n");
    /* Print first 200 chars of response */
    for (int i = 0; i < len && i < 200; i++) {
        uart_putc(data[i]);
    }
    if (len > 200) {
        uart_puts("\n... (truncated)\n");
    }
    uart_puts("\n");
    tls_client_test_done = 1;
}
#endif

#ifndef WOLFIP_USE_FREERTOS
static void echo_cb(int fd, uint16_t event, void *arg)
{
    struct wolfIP *s = (struct wolfIP *)arg;
    int ret;

    if ((fd == listen_fd) && (event & CB_EVENT_READABLE) && (client_fd == -1)) {
        client_fd = wolfIP_sock_accept(s, listen_fd, NULL, NULL);
        if (client_fd > 0) {
            wolfIP_register_callback(s, client_fd, echo_cb, s);
        }
        return;
    }

    if ((fd == client_fd) && (event & CB_EVENT_READABLE)) {
        ret = wolfIP_sock_recvfrom(s, client_fd, rx_buf, sizeof(rx_buf), 0, NULL, NULL);
        if (ret > 0) {
            (void)wolfIP_sock_sendto(s, client_fd, rx_buf, (uint32_t)ret, 0, NULL, 0);
        } else if (ret == 0) {
            wolfIP_sock_close(s, client_fd);
            client_fd = -1;
        }
    }

    if ((fd == client_fd) && (event & CB_EVENT_CLOSED)) {
        wolfIP_sock_close(s, client_fd);
        client_fd = -1;
    }
}
#endif

int main(void)
{
    struct wolfIP_ll_dev *ll;
#ifndef WOLFIP_USE_FREERTOS
    struct wolfIP_sockaddr_in addr;
#endif
    uint64_t tick = 0;
    int ret;

    /* Initialize LED first for debug - keep ON to confirm code is running */
    led_init();
    led_on();  /* LED ON = Reset_Handler ran, main() started */

    /* Initialize UART for debug output */
    uart_init();
    rng_init();

    /* Blink to show UART init done */
    led_off();
    delay(200000);
    led_on();
    delay(200000);
    led_off();
    delay(200000);
    led_on();

#ifdef WOLFIP_USE_FREERTOS
#ifdef ENABLE_HTTPS
    uart_puts("\n\n=== wolfIP STM32H563 FreeRTOS HTTPS Server ===\n");
#else
    uart_puts("\n\n=== wolfIP STM32H563 FreeRTOS Echo Server ===\n");
#endif
#else
    uart_puts("\n\n=== wolfIP STM32H563 Echo Server ===\n");
#endif

#if TZEN_ENABLED
    /* Configure TrustZone for Ethernet DMA access */
    uart_puts("Configuring TrustZone for Ethernet DMA...\n");
    {
        uint32_t i;

        /* Expose only the Ethernet DMA window as non-secure. Leaving ALLNS
         * clear keeps the rest of secure flash/SRAM/peripherals secure. */
        SAU_RNR = 0u;
        SAU_RBAR = 0x20098000u & 0xFFFFFFE0u;
        SAU_RLAR = (0x2009FFFFu & 0xFFFFFFE0u) | 1u;
        SAU_CTRL = 0x01u;  /* ENABLE */
        __asm volatile ("dsb sy" ::: "memory");
        __asm volatile ("isb sy" ::: "memory");

        /* Mark MPCBB3 registers 36-39 as non-secure for ETHMEM */
        for (i = 36; i <= 39; i++) {
            GTZC1_MPCBB3_SECCFGR(i) = 0x00000000u;
            GTZC1_MPCBB3_PRIVCFGR(i) = 0x00000000u;
        }
        __asm volatile ("dsb sy" ::: "memory");

        /* Mark Ethernet MAC as non-secure in TZSC */
        GTZC1_TZSC_SECCFGR3 &= ~(1u << 11);
        __asm volatile ("dsb sy" ::: "memory");
    }
#endif

    uart_puts("Initializing wolfIP stack...\n");
    wolfIP_init_static(&IPStack);

    /* Initialize GPIO pins for RMII - MUST happen before Ethernet clocks! */
    uart_puts("Configuring GPIO for RMII...\n");
    eth_gpio_init();

    /* Enable Ethernet MAC, TX, RX clocks AFTER RMII mode is selected */
    uart_puts("Enabling Ethernet clocks...\n");
    RCC_AHB1ENR |= (1u << 19) | (1u << 20) | (1u << 21);
    delay(10000);  /* Allow clocks to stabilize */

