wolfSSL/wolfip/src/port/stm32h563/main.c
    /* Reset Ethernet MAC via RCC - this is CRITICAL! (from FrostZone) */
    uart_puts("Resetting Ethernet MAC...\n");
    RCC_AHB1RSTR |= RCC_AHB1RSTR_ETHRST;
    __asm volatile ("dsb sy" ::: "memory");
    delay(1000);
    RCC_AHB1RSTR &= ~RCC_AHB1RSTR_ETHRST;
    __asm volatile ("dsb sy" ::: "memory");
    delay(10000);

    uart_puts("Initializing Ethernet MAC...\n");
    ll = wolfIP_getdev(IPStack);
    ret = stm32_eth_init(ll, NULL);
    if (ret < 0) {
        uart_puts("  ERROR: stm32_eth_init failed (");
        uart_puthex((uint32_t)ret);
        uart_puts(")\n");
    } else {
        uart_puts("  PHY link: ");
        uart_puts((ret & 0x100) ? "UP" : "DOWN");
        uart_puts(", PHY addr: ");
        uart_puthex(ret & 0xFF);
        uart_puts("\n  MAC: ");
        {
            int mi;
            for (mi = 0; mi < 6; mi++) {
                if (mi > 0) uart_puts(":");
                uart_puthex8(ll->mac[mi]);
            }
        }
        uart_puts("\n");
    }

#ifdef DHCP
    {
        uint32_t dhcp_start_tick;
        uint32_t dhcp_timeout;
        int dhcp_ret;

        dhcp_timeout = 5000;  /* safety-net tick timeout */

        uart_puts("Starting DHCP client...\n");
        dhcp_ret = dhcp_client_init(IPStack);
        if (dhcp_ret < 0) {
            uart_puts("  DHCP init failed (-");
            uart_putdec((uint32_t)(-dhcp_ret));
            uart_puts(")\n");
        } else {
            uart_puts("  DHCP discover sent, waiting for lease...\n");
            /* Wait for DHCP to complete - poll frequently */
            dhcp_start_tick = tick;
            while (!dhcp_bound(IPStack) && dhcp_client_is_running(IPStack)) {
                /* Poll the stack - this processes received packets and sends pending data */
                (void)wolfIP_poll(IPStack, tick);
                /* Increment tick counter (approximate 1ms per iteration at 64MHz HSI)
                 * volatile loop ~8 cycles/iter: 8000 * 8 / 64MHz = 1ms */
                tick++;
                delay(8000);
                /* Check for timeout */
                if ((tick - dhcp_start_tick) > dhcp_timeout)
                    break;
            }
            if (dhcp_bound(IPStack)) {
                ip4 ip = 0, nm = 0, gw = 0;
                wolfIP_ipconfig_get(IPStack, &ip, &nm, &gw);
                uart_puts("DHCP configuration received:\n");
                uart_puts("  IP: ");
                uart_putip4(ip);
                uart_puts("\n  Mask: ");
                uart_putip4(nm);
                uart_puts("\n  GW: ");
                uart_putip4(gw);
                uart_puts("\n");
            } else {
                ip4 ip = atoip4(WOLFIP_IP);
                ip4 nm = atoip4(WOLFIP_NETMASK);
                ip4 gw = atoip4(WOLFIP_GW);
                uart_puts("  DHCP timeout - falling back to static IP\n");
                uart_puts("  IP: ");
                uart_putip4(ip);
                uart_puts("\n  Mask: ");
                uart_putip4(nm);
                uart_puts("\n  GW: ");
                uart_putip4(gw);
                uart_puts("\n");
                wolfIP_ipconfig_set(IPStack, ip, nm, gw);
            }
        }
    }
#else
    {
        ip4 ip = atoip4(WOLFIP_IP);
        ip4 nm = atoip4(WOLFIP_NETMASK);
        ip4 gw = atoip4(WOLFIP_GW);
        uart_puts("Setting IP configuration:\n");
        uart_puts("  IP: ");
        uart_putip4(ip);
        uart_puts("\n  Mask: ");
        uart_putip4(nm);
        uart_puts("\n  GW: ");
        uart_putip4(gw);
        uart_puts("\n");
        wolfIP_ipconfig_set(IPStack, ip, nm, gw);
    }
#endif

#ifdef WOLFIP_USE_FREERTOS
    uart_puts("Starting FreeRTOS BSD socket layer...\n");
    ret = wolfip_freertos_socket_init(IPStack, 4, 1024);
    if (ret < 0) {
        uart_puts("ERROR: FreeRTOS socket init failed\n");
        return 1;
    }

#ifdef ENABLE_HTTPS
    uart_puts("Creating FreeRTOS HTTPS task on port 443...\n");
    ret = https_server_freertos_start(IPStack, HTTPS_WEB_PORT, uart_puts);
    if (ret < 0) {
        uart_puts("ERROR: FreeRTOS HTTPS task init failed\n");
        return 1;
    }
#else
    uart_puts("Creating FreeRTOS TCP echo task on port 7...\n");
    ret = echo_server_freertos_start(IPStack, ECHO_PORT, uart_puts);
    if (ret < 0) {
        uart_puts("ERROR: FreeRTOS echo task init failed\n");
        return 1;
    }
#endif

    uart_puts("Starting FreeRTOS scheduler...\n");
#ifdef ENABLE_HTTPS
    uart_puts("  HTTPS Server: port 443\n");
#else
    uart_puts("  TCP Echo: port 7\n");
#endif
    vTaskStartScheduler();
    uart_puts("ERROR: vTaskStartScheduler returned\n");
    return 1;
#else
    uart_puts("Creating TCP socket on port 7...\n");
    listen_fd = wolfIP_sock_socket(IPStack, AF_INET, IPSTACK_SOCK_STREAM, 0);
    wolfIP_register_callback(IPStack, listen_fd, echo_cb, IPStack);

    memset(&addr, 0, sizeof(addr));
    addr.sin_family = AF_INET;
    addr.sin_port = ee16(ECHO_PORT);
    addr.sin_addr.s_addr = 0;
    (void)wolfIP_sock_bind(IPStack, listen_fd, (struct wolfIP_sockaddr *)&addr, sizeof(addr));
    (void)wolfIP_sock_listen(IPStack, listen_fd, 1);

#ifdef ENABLE_TLS
    uart_puts("Initializing TLS server on port 8443...\n");
    if (tls_server_init(IPStack, TLS_PORT, uart_puts) < 0) {
        uart_puts("ERROR: TLS server init failed\n");
    }

#ifdef ENABLE_TLS_CLIENT
    uart_puts("Initializing TLS client...\n");
    if (tls_client_init(IPStack, uart_puts) < 0) {
        uart_puts("ERROR: TLS client init failed\n");
    }
#endif
#endif

#ifdef ENABLE_HTTPS
    uart_puts("Initializing HTTPS server on port 443...\n");

    /* Create SSL context for HTTPS */
    https_ssl_ctx = wolfSSL_CTX_new(wolfTLSv1_3_server_method());
    if (https_ssl_ctx) {
        wolfSSL_CTX_use_certificate_buffer(https_ssl_ctx,
            (const unsigned char *)server_cert_pem, strlen(server_cert_pem),
            SSL_FILETYPE_PEM);
        wolfSSL_CTX_use_PrivateKey_buffer(https_ssl_ctx,
            (const unsigned char *)server_key_pem, strlen(server_key_pem),
            SSL_FILETYPE_PEM);

