wolfSSL/wolfip/src/port/stm32h563/main.c
        if (httpd_init(&https_server, IPStack, HTTPS_WEB_PORT, https_ssl_ctx) == 0) {
            httpd_register_handler(&https_server, "/", https_status_handler);
            uart_puts("HTTPS: Server ready on port 443\n");
        } else {
            uart_puts("ERROR: HTTPS server init failed\n");
        }
    } else {
        uart_puts("ERROR: HTTPS SSL context failed\n");
    }
#endif

#ifdef ENABLE_SSH
    uart_puts("Initializing SSH server on port 22...\n");
    if (ssh_server_init(IPStack, SSH_PORT, uart_puts) < 0) {
        uart_puts("ERROR: SSH server init failed\n");
    }
#endif

#ifdef ENABLE_MQTT
    uart_puts("Initializing MQTT client...\n");
    {
        mqtt_client_config_t mqtt_config = {
            .broker_ip = "54.36.178.49",  /* test.mosquitto.org IP (updated) */
            .broker_port = 8883,           /* TLS port */
            .client_id = "wolfip-stm32h563",
            .publish_topic = "wolfip/status",
            .keep_alive_sec = 60
        };
        if (mqtt_client_init(IPStack, &mqtt_config, uart_puts) < 0) {
            uart_puts("ERROR: MQTT client init failed\n");
        }
    }
#endif

#ifdef ENABLE_MQTT_BROKER
    uart_puts("Initializing MQTT broker...\n");
    {
        mqtt_broker_config_t broker_config = {
            .port = 8883,
            .use_tls = 1
        };
        if (mqtt_broker_init(IPStack, &broker_config, uart_puts) < 0) {
            uart_puts("ERROR: MQTT broker init failed\n");
        }
    }
#endif

    uart_puts("Entering main loop. Ready for connections!\n");
    uart_puts("  TCP Echo: port 7\n");
#ifdef ENABLE_TLS_CLIENT
    uart_puts("  TLS Client: will connect to Google after ~2s\n");
#endif
#ifdef ENABLE_HTTPS
    uart_puts("  HTTPS Server: port 443\n");
#endif
#ifdef ENABLE_SSH
    uart_puts("  SSH Server: port 22\n");
#endif
#ifdef ENABLE_MQTT
    uart_puts("  MQTT Client: connecting to broker\n");
#endif

    for (;;) {
        (void)wolfIP_poll(IPStack, tick++);

#ifdef ENABLE_HTTPS
        /* Update HTTPS server status info for handler */
        wolfIP_ipconfig_get(IPStack, &https_device_ip, NULL, NULL);
        https_uptime_sec = (uint32_t)(tick / 1000);
#endif

#ifdef ENABLE_SSH
        /* Poll SSH server */
        ssh_server_poll();
#endif

#ifdef ENABLE_MQTT
        /* Poll MQTT client */
        mqtt_client_poll();

        /* Publish status periodically (every ~60 seconds) */
        {
            static uint64_t last_publish_tick = 0;
            if (mqtt_client_is_connected() &&
                (tick - last_publish_tick) > 60000) {
                char status_msg[64];
                ip4 ip = 0;
                wolfIP_ipconfig_get(IPStack, &ip, NULL, NULL);

                /* Format: "STM32H563 online, IP: x.x.x.x, uptime: XXXXX" */
                strcpy(status_msg, "STM32H563 online, uptime: ");
                {
                    char num_buf[12];
                    uint32_t uptime = (uint32_t)(tick / 1000);
                    int i = 0, j;
                    char tmp[12];

                    if (uptime == 0) {
                        num_buf[0] = '0';
                        num_buf[1] = '\0';
                    } else {
                        while (uptime > 0 && i < 11) {
                            tmp[i++] = '0' + (uptime % 10);
                            uptime /= 10;
                        }
                        j = 0;
                        while (i > 0) {
                            num_buf[j++] = tmp[--i];
                        }
                        num_buf[j] = '\0';
                    }
                    strcat(status_msg, num_buf);
                }
                strcat(status_msg, "s");

                mqtt_client_publish(status_msg);
                last_publish_tick = tick;
            }
        }
#endif

#ifdef ENABLE_MQTT_BROKER
        /* Poll MQTT broker */
        mqtt_broker_poll();

        /* Update broker uptime counter (approximate seconds from tick) */
        broker_uptime_sec = (unsigned long)(tick / 1000);
#endif

#ifdef ENABLE_TLS_CLIENT
        /* TLS client test: connect to Google after network settles */
        if (!tls_client_test_started && tick > 5000) {
            uart_puts("\n--- TLS Client Test: Connecting to Google ---\n");
            uart_puts("Target: ");
            uart_puts(GOOGLE_IP);
            uart_puts(":");
            uart_putdec(GOOGLE_HTTPS_PORT);
            uart_puts("\n");

            if (tls_client_connect(GOOGLE_IP, GOOGLE_HTTPS_PORT, tls_response_cb, NULL) == 0) {
                uart_puts("TLS Client: Connection initiated\n");
            } else {
                uart_puts("TLS Client: Failed to start connection\n");
            }
            tls_client_test_started = 1;
        }

        /* Poll TLS client state machine */
        tls_client_poll();

        /* Send HTTP request once TLS handshake completes */
        if (tls_client_is_connected() && !tls_client_test_done) {
            static int request_sent = 0;
            if (!request_sent) {
                const char *http_req = "GET / HTTP/1.1\r\n"
                                       "Host: google.com\r\n"
                                       "Connection: close\r\n\r\n";
                uart_puts("TLS Client: Sending HTTP GET request...\n");
                if (tls_client_send(http_req, (int)strlen(http_req)) > 0) {
                    uart_puts("TLS Client: Request sent\n");
                } else {
                    uart_puts("TLS Client: Send failed\n");
                }
                request_sent = 1;
            }
        }
#endif

        /* Toggle LED every ~256K iterations as heartbeat */
        if ((tick & 0x3FFFF) == 0) {
            led_toggle();
        }
    }
    return 0;
#endif
}
